app/controllers/articles_controller.rb

	def create
		@article = Article.new(params[:article])
		@article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Sun, 05 Aug 2012 19:34:14 UTC +00:00], ["title", "test"], ["updated_at", Sun, 05 Aug 2012 19:34:14 UTC +00:00]]

	def update
		@article = Article.find(params[:id])
		@article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "image_file_name" = 'beast.png', "image_content_type" = 'image/png', "image_file_size" = 27720, "image_updated_at" = '2012-08-11 23:48:15.324989', "updated_at" = '2012-08-11 23:48:15.326815' WHERE "articles"."id" = 12