app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", "c"], ["body", "c"], ["created_at", Wed, 08 Aug 2012 04:26:04 UTC +00:00], ["updated_at", Wed, 08 Aug 2012 04:26:04 UTC +00:00]]
---
	def create
		article_id = params[:comment].delete(:article_id)

		@comment = Comment.new(params[:comment])
		@comment.article_id = article_id

		@comment.save